# 4
# Создать функцию для взаимодействия с пользователем.
# Функция должна взаимодействовать с пользователем через консоль.
# Самостоятельно придумать сценарии и возможности взаимодействия с
# пользователем. Например, позволять пользователю указывать, с каких платформ
# он хочет получить вакансии, ввести поисковый запрос, получить топ-N вакансий
# по зарплате, получить вакансии в отсортированном виде, получить вакансии,
# в описании которых есть определенные ключевые слова,
# например postgres, и т. п.
